Show / Hide Table of Contents
Interface IGeometryPart
Geotery interface
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public interface IGeometryPart
Properties
Improve this Doc   View Source
Edges
Lines of input edges on wall or beam
Declaration
List<ReferenceElement> Edges { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
 Improve this Doc
 View Source